20240117062321-calling_parent_constructors_with_super.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-03 Tue 07:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Calling Parent Constructors with super()</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Calling Parent Constructors with super()</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3d89ccc">1. Calling Parent Constructors with super()</a>
<ul>
<li><a href="#org3b09f1f">1.1. Example</a></li>
<li><a href="#orge5b8605">1.2. <span class="underline">Exam Trick</span></a>
<ul>
<li><a href="#org7b59754">1.2.1. Example (Non callable)</a></li>
</ul>
</li>
<li><a href="#orgb71bc3a">1.3. Overloaded Parent Constructors</a>
<ul>
<li><a href="#org9572013">1.3.1. Example</a></li>
<li><a href="#org9dc90e3">1.3.2. <span class="underline">Exam Trick</span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3d89ccc" class="outline-2">
<h2 id="org3d89ccc"><span class="section-number-2">1.</span> Calling Parent Constructors with super()</h2>
<div class="outline-text-2" id="text-1">
<p>
The first statement of every constructor is a call to a <b>parent</b> constructor using <code>super()</code> or <b>another</b> constructor in the class using <a href="20240114181242-calling_overloaded_constructors_with_this.html#ID-6d0ddb05-83c3-4a23-bf52-9fab2633bd99">this()</a>.
</p>

<p>
<code>super()</code>, calls a <b>parent</b> constructor.
</p>
</div>

<div id="outline-container-org3b09f1f" class="outline-3">
<h3 id="org3b09f1f"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Animal</span> {
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">age</span>;

    <span class="org-keyword">public</span> Animal(<span class="org-type">int</span> <span class="org-variable-name">age</span>) {
        <span class="org-keyword">super</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">Refers to constructor in java.lang.Object
</span>        <span class="org-keyword">this</span>.age = age;
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Zebra</span> <span class="org-keyword">extends</span> <span class="org-type">Animal</span> {
    <span class="org-keyword">public</span> Zebra(<span class="org-type">int</span> <span class="org-variable-name">age</span>) {
        <span class="org-keyword">super</span>(age); <span class="org-comment-delimiter">// </span><span class="org-comment">Refers to constructor in Animal
</span>    }
    <span class="org-keyword">public</span> Zebra() {
        <span class="org-keyword">this</span>(4); <span class="org-comment-delimiter">// </span><span class="org-comment">Refers to constructor in Zebra with ~int~ argument
</span>    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge5b8605" class="outline-3">
<h3 id="orge5b8605"><span class="section-number-3">1.2.</span> <span class="underline">Exam Trick</span></h3>
<div class="outline-text-3" id="text-1-2">
<p>
Like calling <a href="20240114181242-calling_overloaded_constructors_with_this.html#ID-6d0ddb05-83c3-4a23-bf52-9fab2633bd99">this()</a>, calling <code>super()</code> can only be used as the <b>first</b> statement of the constructor.
</p>
</div>

<div id="outline-container-org7b59754" class="outline-4">
<h4 id="org7b59754"><span class="section-number-4">1.2.1.</span> Example (Non callable)</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Zoo</span> {
    <span class="org-keyword">public</span> Zoo() {
        System.out.println(<span class="org-string">"Zoo created"</span>);
        <span class="org-keyword">super</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>    }
}
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Zoo</span> {
    <span class="org-keyword">public</span> Zoo() {
        <span class="org-keyword">super</span>();
        System.out.println(<span class="org-string">"Zoo created"</span>);
        <span class="org-keyword">super</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb71bc3a" class="outline-3">
<h3 id="orgb71bc3a"><span class="section-number-3">1.3.</span> Overloaded Parent Constructors</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org9572013" class="outline-4">
<h4 id="org9572013"><span class="section-number-4">1.3.1.</span> Example</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
If the <code>parent class</code> has more than one <code>constructor</code>, the <code>child class</code> may use any valid <code>parent</code> <code>constructor</code> in its definition:
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Animal</span> {
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">age</span>;
    <span class="org-keyword">private</span> <span class="org-type">String</span> <span class="org-variable-name">name</span>;

    <span class="org-keyword">public</span> Animal(<span class="org-type">int</span> <span class="org-variable-name">age</span>, String name) { <span class="org-comment-delimiter">// </span><span class="org-comment">First Constructor
</span>        <span class="org-keyword">super</span>();
        <span class="org-keyword">this</span>.age = age;
        <span class="org-keyword">this</span>.name = name;
    }

    <span class="org-keyword">public</span> Animal(<span class="org-type">int</span> <span class="org-variable-name">age</span>) { <span class="org-comment-delimiter">// </span><span class="org-comment">Second Constructor
</span>        <span class="org-keyword">super</span>();
        <span class="org-keyword">this</span>.age = age;
        <span class="org-keyword">this</span>.name = <span class="org-constant">null</span>;
    }
}

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Gorilla</span> <span class="org-keyword">extends</span> <span class="org-type">Animal</span> {
    <span class="org-keyword">public</span> Gorilla(<span class="org-type">int</span> <span class="org-variable-name">age</span>) {
        <span class="org-keyword">super</span>(age,<span class="org-string">"Gorilla"</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">Calls the first Animal constructor
</span>    }
    <span class="org-keyword">public</span> Gorilla() {
        <span class="org-keyword">super</span>(5); <span class="org-comment-delimiter">// </span><span class="org-comment">Calls the second Animal constructor
</span>    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org9dc90e3" class="outline-4">
<h4 id="org9dc90e3"><span class="section-number-4">1.3.2.</span> <span class="underline">Exam Trick</span></h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
The <a href="20231224095703-javac.html#ID-d5b4004d-b5db-48a2-8e85-09359ca61a42">javac</a> automatically inserts a call to the <b>no­argument</b> <code>constructor</code> <code>super()</code> if you do <b>not</b> explicitly call <code>this()</code> or <code>super()</code> as the first line of a constructor.
</p>

<p>
For example, the following three <code>class</code> and <code>constructor</code> definitions are equivalent, because the <b>compiler</b> will automatically convert them all to the last example.
</p>
</div>

<ol class="org-ol">
<li><a id="org3ab1025"></a>Example<br />
<div class="outline-text-5" id="text-1-3-2-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Donkey</span> {}

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Donkey</span> {
    <span class="org-keyword">public</span> Donkey() {}
}

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Donkey</span> {
    <span class="org-keyword">public</span> Donkey() {
        <span class="org-keyword">super</span>();
    }
}
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
